Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA1_DFP/2.4.81/samha1ab/edc/ATSAMHA1E15AB.PIC
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="WRBADDR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41004838">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="WRBADDR" edc:nzwidth="0x20" edc:desc="Write-Back Memory Base Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x4100483C"/>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="CHID" edc:nzwidth="0x8" edc:access="----nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF" edc:_addr="0x4100483F">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="ID" edc:nzwidth="0x4" edc:desc="Channel ID"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="CHCTRLA" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x41004840">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Channel Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Channel Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x41004841"/>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="CHCTRLB" edc:nzwidth="0x20" edc:access="------nnnn--------nnnnnn-nnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3C03F7F" edc:_addr="0x41004844">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="EVACT" edc:nzwidth="0x3" edc:desc="Event Input Action">
              <edc:SFRFieldSemantic edc:cname="NOACT" edc:desc="No action" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TRIG" edc:desc="Transfer and periodic transfer trigger" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CTRIG" edc:desc="Conditional transfer trigger" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CBLOCK" edc:desc="Conditional block transfer" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="SUSPEND" edc:desc="Channel suspend operation" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="RESUME" edc:desc="Channel resume operation" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="SSKIP" edc:desc="Skip next block suspend action" edc:when="(field &amp; 0x7) == 0x6"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EVIE" edc:nzwidth="0x1" edc:desc="Channel Event Input Enable"/>
            <edc:SFRFieldDef edc:cname="EVOE" edc:nzwidth="0x1" edc:desc="Channel Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="LVL" edc:nzwidth="0x2" edc:desc="Channel Arbitration Level">
              <edc:SFRFieldSemantic edc:cname="LVL0" edc:desc="Channel Priority Level 0" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LVL1" edc:desc="Channel Priority Level 1" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="LVL2" edc:desc="Channel Priority Level 2" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="LVL3" edc:desc="Channel Priority Level 3" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TRIGSRC" edc:nzwidth="0x6" edc:desc="Peripheral Trigger Source">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Only software/event triggers" edc:when="(field &amp; 0x3F) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="TRIGACT" edc:nzwidth="0x2" edc:desc="Trigger Action">
              <edc:SFRFieldSemantic edc:cname="BLOCK" edc:desc="One trigger required for each block transfer" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BEAT" edc:desc="One trigger required for each beat transfer" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TRANSACTION" edc:desc="One trigger required for each transaction" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMD" edc:nzwidth="0x2" edc:desc="Software Command">
              <edc:SFRFieldSemantic edc:cname="NOACT" edc:desc="No action" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SUSPEND" edc:desc="Channel suspend operation" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="RESUME" edc:desc="Channel resume operation" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x41004848"/>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="CHINTENCLR" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x4100484C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="TERR" edc:nzwidth="0x1" edc:desc="Transfer Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TCMPL" edc:nzwidth="0x1" edc:desc="Transfer Complete Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:nzwidth="0x1" edc:desc="Channel Suspend Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="CHINTENSET" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x4100484D">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="TERR" edc:nzwidth="0x1" edc:desc="Transfer Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TCMPL" edc:nzwidth="0x1" edc:desc="Transfer Complete Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:nzwidth="0x1" edc:desc="Channel Suspend Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="CHINTFLAG" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x4100484E">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="TERR" edc:nzwidth="0x1" edc:desc="Transfer Error"/>
            <edc:SFRFieldDef edc:cname="TCMPL" edc:nzwidth="0x1" edc:desc="Transfer Complete"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:nzwidth="0x1" edc:desc="Channel Suspend"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DMAC" edc:cname="CHSTATUS" edc:nzwidth="0x8" edc:access="-----rrr" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x4100484F">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="PEND" edc:nzwidth="0x1" edc:desc="Channel Pending"/>
            <edc:SFRFieldDef edc:cname="BUSY" edc:nzwidth="0x1" edc:desc="Channel Busy"/>
            <edc:SFRFieldDef edc:cname="FERR" edc:nzwidth="0x1" edc:desc="Fetch Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x17B0" edc:_addr="0x41004850"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="POSITION" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:impl="0xFFFFFFFC" edc:_addr="0x41006000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MTB">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WRAP" edc:nzwidth="0x1" edc:desc="Pointer Value Wraps"/>
            <edc:SFRFieldDef edc:cname="POINTER" edc:nzwidth="0x1D" edc:desc="Trace Packet Location Pointer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="MASTER" edc:nzwidth="0x20" edc:access="n---------------------nnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x800003FF" edc:_addr="0x41006004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MTB">
            <edc:SFRFieldDef edc:cname="MASK" edc:nzwidth="0x5" edc:desc="Maximum Value of the Trace Buffer in SRAM"/>
            <edc:SFRFieldDef edc:cname="TSTARTEN" edc:nzwidth="0x1" edc:desc="Trace Start Input Enable"/>
            <edc:SFRFieldDef edc:cname="TSTOPEN" edc:nzwidth="0x1" edc:desc="Trace Stop Input Enable"/>
            <edc:SFRFieldDef edc:cname="SFRWPRIV" edc:nzwidth="0x1" edc:desc="Special Function Register Write Privilege"/>
            <edc:SFRFieldDef edc:cname="RAMPRIV" edc:nzwidth="0x1" edc:desc="SRAM Privilege"/>
            <edc:SFRFieldDef edc:cname="HALTREQ" edc:nzwidth="0x1" edc:desc="Halt Request"/>
            <edc:AdjustPoint edc:offset="0x15"/>
            <edc:SFRFieldDef edc:cname="EN" edc:nzwidth="0x1" edc:desc="Main Trace Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
