Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA1_DFP/2.4.81/samha1ab/edc/ATSAMHA1E15AB.PIC
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="FLOW" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnn-nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFFFB" edc:_addr="0x41006008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MTB">
            <edc:SFRFieldDef edc:cname="AUTOSTOP" edc:nzwidth="0x1" edc:desc="Auto Stop Tracing"/>
            <edc:SFRFieldDef edc:cname="AUTOHALT" edc:nzwidth="0x1" edc:desc="Auto Halt Request"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WATERMARK" edc:nzwidth="0x1D" edc:desc="Watermark value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="BASE" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4100600C"/>
      <edc:AdjustPoint edc:offset="0xEF0" edc:_addr="0x41006010"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="ITCTRL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x41006F00"/>
      <edc:AdjustPoint edc:offset="0x9C" edc:_addr="0x41006F04"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="CLAIMSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x41006FA0"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="CLAIMCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x41006FA4"/>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x41006FA8"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="LOCKACCESS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x41006FB0"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="LOCKSTATUS" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FB4"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="AUTHSTATUS" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FB8"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="DEVARCH" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FBC"/>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x41006FC0"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="DEVID" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FC8"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="DEVTYPE" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FCC"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="PID4" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FD0"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="PID5" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FD4"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="PID6" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FD8"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="PID7" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FDC"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="PID0" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FE0"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="PID1" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FE4"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="PID2" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FE8"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="PID3" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FEC"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="CID0" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FF0"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="CID1" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FF4"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="CID2" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FF8"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="CID3" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FFC"/>
      <edc:AdjustPoint edc:offset="0x80" edc:_addr="0x41007000"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS0PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41007080"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS0PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41007084"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS1PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41007088"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS1PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100708C"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS2PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41007090"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS2PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41007094"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS3PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41007098"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS3PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100709C"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS4PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410070A0"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS4PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410070A4"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS5PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410070A8"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS5PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410070AC"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS6PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410070B0"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS6PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410070B4"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS7PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410070B8"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS7PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410070BC"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS8PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410070C0"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS8PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410070C4"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS9PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410070C8"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS9PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410070CC"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS10PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410070D0"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS10PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410070D4"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS11PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410070D8"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS11PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410070DC"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS12PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410070E0"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS12PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410070E4"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS13PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410070E8"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS13PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410070EC"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS14PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410070F0"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS14PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410070F4"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS15PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410070F8"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS15PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410070FC"/>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x41007100"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="SFR0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41007110">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
