Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA1_DFP/2.4.81/samha1ab/edc/ATSAMHA1E15AB.PIC
      <edc:AdjustPoint edc:offset="0xFF8EB0" edc:_addr="0x41007150"/>
      <edc:SFRDef ltx:memberofperipheral="PAC2" edc:cname="WPCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn-" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFFFE" edc:_addr="0x42000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC2">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WP" edc:nzwidth="0x1F" edc:desc="Write Protection Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC2" edc:cname="WPSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn-" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFFFE" edc:_addr="0x42000004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC2">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WP" edc:nzwidth="0x1F" edc:desc="Write Protection Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3F8" edc:_addr="0x42000008"/>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="CTRL" edc:nzwidth="0x8" edc:access="---w---w" edc:por="00000000" edc:mclr="00000000" edc:impl="0x11" edc:_addr="0x42000400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="GCLKREQ" edc:nzwidth="0x1" edc:desc="Generic Clock Requests"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x42000401"/>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="CHANNEL" edc:nzwidth="0x20" edc:access="----nnnn-nnnnnnn-------n----nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF7F010F" edc:_addr="0x42000404">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:nzwidth="0x4" edc:desc="Channel Selection"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SWEVT" edc:nzwidth="0x1" edc:desc="Software Event"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="EVGEN" edc:nzwidth="0x7" edc:desc="Event Generator Selection"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PATH" edc:nzwidth="0x2" edc:desc="Path Selection">
              <edc:SFRFieldSemantic edc:cname="SYNCHRONOUS" edc:desc="Synchronous path" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RESYNCHRONIZED" edc:desc="Resynchronized path" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="ASYNCHRONOUS" edc:desc="Asynchronous path" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EDGSEL" edc:nzwidth="0x2" edc:desc="Edge Detection Selection">
              <edc:SFRFieldSemantic edc:cname="NO_EVT_OUTPUT" edc:desc="No event output when using the resynchronized or synchronous path" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RISING_EDGE" edc:desc="Event detection only on the rising edge of the signal from the event generator when using the resynchronized or synchronous path" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FALLING_EDGE" edc:desc="Event detection only on the falling edge of the signal from the event generator when using the resynchronized or synchronous path" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="BOTH_EDGES" edc:desc="Event detection on rising and falling edges of the signal from the event generator when using the resynchronized or synchronous path" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="USER" edc:nzwidth="0x10" edc:access="---nnnnn---nnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x1F1F" edc:_addr="0x42000408">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="USER" edc:nzwidth="0x5" edc:desc="User Multiplexer Selection"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:nzwidth="0x5" edc:desc="Channel Event Selection">
              <edc:SFRFieldSemantic edc:cname="0" edc:desc="No Channel Output Selected" edc:when="(field &amp; 0x1F) == 0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x4200040A"/>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="CHSTATUS" edc:nzwidth="0x20" edc:access="----rrrr----rrrrrrrrrrrrrrrrrrrr" edc:por="00000000000011110000000011111111" edc:mclr="00000000000011110000000011111111" edc:impl="0xF0FFFFF" edc:_addr="0x4200040C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="USRRDY0" edc:nzwidth="0x1" edc:desc="Channel 0 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY1" edc:nzwidth="0x1" edc:desc="Channel 1 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY2" edc:nzwidth="0x1" edc:desc="Channel 2 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY3" edc:nzwidth="0x1" edc:desc="Channel 3 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY4" edc:nzwidth="0x1" edc:desc="Channel 4 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY5" edc:nzwidth="0x1" edc:desc="Channel 5 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY6" edc:nzwidth="0x1" edc:desc="Channel 6 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY7" edc:nzwidth="0x1" edc:desc="Channel 7 User Ready"/>
            <edc:SFRFieldDef edc:cname="CHBUSY0" edc:nzwidth="0x1" edc:desc="Channel 0 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY1" edc:nzwidth="0x1" edc:desc="Channel 1 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY2" edc:nzwidth="0x1" edc:desc="Channel 2 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY3" edc:nzwidth="0x1" edc:desc="Channel 3 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY4" edc:nzwidth="0x1" edc:desc="Channel 4 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY5" edc:nzwidth="0x1" edc:desc="Channel 5 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY6" edc:nzwidth="0x1" edc:desc="Channel 6 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY7" edc:nzwidth="0x1" edc:desc="Channel 7 Busy"/>
            <edc:SFRFieldDef edc:cname="USRRDY8" edc:nzwidth="0x1" edc:desc="Channel 8 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY9" edc:nzwidth="0x1" edc:desc="Channel 9 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY10" edc:nzwidth="0x1" edc:desc="Channel 10 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY11" edc:nzwidth="0x1" edc:desc="Channel 11 User Ready"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CHBUSY8" edc:nzwidth="0x1" edc:desc="Channel 8 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY9" edc:nzwidth="0x1" edc:desc="Channel 9 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY10" edc:nzwidth="0x1" edc:desc="Channel 10 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY11" edc:nzwidth="0x1" edc:desc="Channel 11 Busy"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="INTENCLR" edc:nzwidth="0x20" edc:access="----nnnn----nnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF0FFFFF" edc:_addr="0x42000410">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="OVR0" edc:nzwidth="0x1" edc:desc="Channel 0 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR1" edc:nzwidth="0x1" edc:desc="Channel 1 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR2" edc:nzwidth="0x1" edc:desc="Channel 2 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR3" edc:nzwidth="0x1" edc:desc="Channel 3 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR4" edc:nzwidth="0x1" edc:desc="Channel 4 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR5" edc:nzwidth="0x1" edc:desc="Channel 5 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR6" edc:nzwidth="0x1" edc:desc="Channel 6 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR7" edc:nzwidth="0x1" edc:desc="Channel 7 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD0" edc:nzwidth="0x1" edc:desc="Channel 0 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD1" edc:nzwidth="0x1" edc:desc="Channel 1 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD2" edc:nzwidth="0x1" edc:desc="Channel 2 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD3" edc:nzwidth="0x1" edc:desc="Channel 3 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD4" edc:nzwidth="0x1" edc:desc="Channel 4 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD5" edc:nzwidth="0x1" edc:desc="Channel 5 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD6" edc:nzwidth="0x1" edc:desc="Channel 6 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD7" edc:nzwidth="0x1" edc:desc="Channel 7 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR8" edc:nzwidth="0x1" edc:desc="Channel 8 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR9" edc:nzwidth="0x1" edc:desc="Channel 9 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR10" edc:nzwidth="0x1" edc:desc="Channel 10 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR11" edc:nzwidth="0x1" edc:desc="Channel 11 Overrun Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="EVD8" edc:nzwidth="0x1" edc:desc="Channel 8 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD9" edc:nzwidth="0x1" edc:desc="Channel 9 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD10" edc:nzwidth="0x1" edc:desc="Channel 10 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD11" edc:nzwidth="0x1" edc:desc="Channel 11 Event Detection Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="INTENSET" edc:nzwidth="0x20" edc:access="----nnnn----nnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF0FFFFF" edc:_addr="0x42000414">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="OVR0" edc:nzwidth="0x1" edc:desc="Channel 0 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR1" edc:nzwidth="0x1" edc:desc="Channel 1 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR2" edc:nzwidth="0x1" edc:desc="Channel 2 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR3" edc:nzwidth="0x1" edc:desc="Channel 3 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR4" edc:nzwidth="0x1" edc:desc="Channel 4 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR5" edc:nzwidth="0x1" edc:desc="Channel 5 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR6" edc:nzwidth="0x1" edc:desc="Channel 6 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR7" edc:nzwidth="0x1" edc:desc="Channel 7 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD0" edc:nzwidth="0x1" edc:desc="Channel 0 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD1" edc:nzwidth="0x1" edc:desc="Channel 1 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD2" edc:nzwidth="0x1" edc:desc="Channel 2 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD3" edc:nzwidth="0x1" edc:desc="Channel 3 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD4" edc:nzwidth="0x1" edc:desc="Channel 4 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD5" edc:nzwidth="0x1" edc:desc="Channel 5 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD6" edc:nzwidth="0x1" edc:desc="Channel 6 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD7" edc:nzwidth="0x1" edc:desc="Channel 7 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR8" edc:nzwidth="0x1" edc:desc="Channel 8 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR9" edc:nzwidth="0x1" edc:desc="Channel 9 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR10" edc:nzwidth="0x1" edc:desc="Channel 10 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR11" edc:nzwidth="0x1" edc:desc="Channel 11 Overrun Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="EVD8" edc:nzwidth="0x1" edc:desc="Channel 8 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD9" edc:nzwidth="0x1" edc:desc="Channel 9 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD10" edc:nzwidth="0x1" edc:desc="Channel 10 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD11" edc:nzwidth="0x1" edc:desc="Channel 11 Event Detection Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="INTFLAG" edc:nzwidth="0x20" edc:access="----nnnn----nnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF0FFFFF" edc:_addr="0x42000418">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="OVR0" edc:nzwidth="0x1" edc:desc="Channel 0 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR1" edc:nzwidth="0x1" edc:desc="Channel 1 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR2" edc:nzwidth="0x1" edc:desc="Channel 2 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR3" edc:nzwidth="0x1" edc:desc="Channel 3 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR4" edc:nzwidth="0x1" edc:desc="Channel 4 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR5" edc:nzwidth="0x1" edc:desc="Channel 5 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR6" edc:nzwidth="0x1" edc:desc="Channel 6 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR7" edc:nzwidth="0x1" edc:desc="Channel 7 Overrun"/>
            <edc:SFRFieldDef edc:cname="EVD0" edc:nzwidth="0x1" edc:desc="Channel 0 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD1" edc:nzwidth="0x1" edc:desc="Channel 1 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD2" edc:nzwidth="0x1" edc:desc="Channel 2 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD3" edc:nzwidth="0x1" edc:desc="Channel 3 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD4" edc:nzwidth="0x1" edc:desc="Channel 4 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD5" edc:nzwidth="0x1" edc:desc="Channel 5 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD6" edc:nzwidth="0x1" edc:desc="Channel 6 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD7" edc:nzwidth="0x1" edc:desc="Channel 7 Event Detection"/>
            <edc:SFRFieldDef edc:cname="OVR8" edc:nzwidth="0x1" edc:desc="Channel 8 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR9" edc:nzwidth="0x1" edc:desc="Channel 9 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR10" edc:nzwidth="0x1" edc:desc="Channel 10 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR11" edc:nzwidth="0x1" edc:desc="Channel 11 Overrun"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="EVD8" edc:nzwidth="0x1" edc:desc="Channel 8 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD9" edc:nzwidth="0x1" edc:desc="Channel 9 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD10" edc:nzwidth="0x1" edc:desc="Channel 10 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD11" edc:nzwidth="0x1" edc:desc="Channel 11 Event Detection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1BE4" edc:_addr="0x4200041C"/>
      <edc:SFRDef ltx:memberofperipheral="TCC0" edc:cname="CTRLA" edc:nzwidth="0x20" edc:access="----nnnn---------nnnnnnn-nn---nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF007F63" edc:_addr="0x42002000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC0">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RESOLUTION" edc:nzwidth="0x2" edc:desc="Enhanced Resolution">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="Dithering is disabled" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DITH4" edc:desc="Dithering is done every 16 PWM frames" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DITH5" edc:desc="Dithering is done every 32 PWM frames" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DITH6" edc:desc="Dithering is done every 64 PWM frames" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRESCALER" edc:nzwidth="0x3" edc:desc="Prescaler">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="No division" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide by 2" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Divide by 4" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Divide by 8" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Divide by 16" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="Divide by 64" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="Divide by 256" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DIV1024" edc:desc="Divide by 1024" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
            <edc:SFRFieldDef edc:cname="PRESCSYNC" edc:nzwidth="0x2" edc:desc="Prescaler and Counter Synchronization Selection">
              <edc:SFRFieldSemantic edc:cname="GCLK" edc:desc="Reload or reset counter on next GCLK" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESC" edc:desc="Reload or reset counter on next prescaler clock" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="RESYNC" edc:desc="Reload or reset counter on next GCLK and reset prescaler counter" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ALOCK" edc:nzwidth="0x1" edc:desc="Auto Lock"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="CPTEN0" edc:nzwidth="0x1" edc:desc="Capture Channel 0 Enable"/>
            <edc:SFRFieldDef edc:cname="CPTEN1" edc:nzwidth="0x1" edc:desc="Capture Channel 1 Enable"/>
            <edc:SFRFieldDef edc:cname="CPTEN2" edc:nzwidth="0x1" edc:desc="Capture Channel 2 Enable"/>
            <edc:SFRFieldDef edc:cname="CPTEN3" edc:nzwidth="0x1" edc:desc="Capture Channel 3 Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCC0" edc:cname="CTRLBCLR" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x42002004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC0">
            <edc:SFRFieldDef edc:cname="DIR" edc:nzwidth="0x1" edc:desc="Counter Direction"/>
            <edc:SFRFieldDef edc:cname="LUPD" edc:nzwidth="0x1" edc:desc="Lock Update"/>
            <edc:SFRFieldDef edc:cname="ONESHOT" edc:nzwidth="0x1" edc:desc="One-Shot"/>
            <edc:SFRFieldDef edc:cname="IDXCMD" edc:nzwidth="0x2" edc:desc="Ramp Index Command">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Command disabled: Index toggles between cycles A and B" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="Set index: cycle B will be forced in the next cycle" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CLEAR" edc:desc="Clear index: cycle A will be forced in the next cycle" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="HOLD" edc:desc="Hold index: the next cycle will be the same as the current cycle" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMD" edc:nzwidth="0x3" edc:desc="TCC Command">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No action" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RETRIGGER" edc:desc="Clear start, restart or retrigger" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="Force stop" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="UPDATE" edc:desc="Force update of double buffered registers" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="READSYNC" edc:desc="Force COUNT read synchronization" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
